<?php

return [

    /*
    |--------------------------------------------------------------------------
    | error code Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during return the json data.
    |
    */

    ## AuthenticateController
    // getRandKey
    '400011' => '发送失败：请求参数有误!',
    '400012' => '发送失败：请输入验证码之后重试！',
    '400013' => '发送失败：您发送验证码次数太多，请24小时之后再试！',
    '400014' => '发送失败：您请求验证码太过频繁，请稍后之后再试！',
    '400015' => '发送失败：发送验证码网关报错！',
    // register
    '400021' => '注册失败：请求参数有误!',
    '400022' => '注册失败：验证码已失效!',
    '400023' => '注册失败：验证码有误！',
    '400024' => '注册失败：创建用户失败！',
    // authenticate
    '400031' => '认证失败！',
    '400032' => '认证失败：创建token失败！',
    '400033' => '认证失败：用户不存在！',
    '400034' => '认证失败：验证码已失效！',
    '400035' => '认证失败：验证码有误！',
    '400036' => '认证失败：请输入验证码之后重试',
    '400037' => '认证失败：参数有误！',
    // resetPassword
    '400041' => '操作失败：参数有误！',
    '400042' => '操作失败：验证码已失效！',
    '400043' => '操作失败：该手机号还未注册',
    '400044' => '操作失败：修改密码失败！',

    ## UserController
    //uploadAvatar
    '401011' => '设置头像失败：请求参数有误!',
    '401012' => '设置头像失败：头像缓存文件夹权限有误',
    //loadAvatar
    '401021' => '读取头像失败：参数有误！',


];
